src/cf/Catalogs/SpaRooms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>SpaRooms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/SpaBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>SpaBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SpaRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SpaServices</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/SpaRooms/Forms/SpaRoomStatus/Ext/Form/Module.bsl
&AtClient
Procedure Generate(Command)
	GenerateAtServer();
EndProcedure

&AtServer
Procedure GenerateAtServer()
	If ValueIsFilled(StartDate) then
		If not ValueIsFilled(EndDate) then
			EndDate = StartDate;
		Endif;
		SpaRoom.GetItems().Clear();
		Query = New Query;
		Query.Text = 
		"SELECT
		|	COUNT(DISTINCT SpaRooms.Description) AS Description,
		|	SpaBookingHistory.Room AS Room,
		|	SpaBookingHistory.StartTime AS StartTime,
		|	SpaBookingHistory.EndTime AS EndTime,
		|	COUNT(SpaBookingHistory.Service) AS ServiceCount,
		|	SpaBookingHistory.Service AS Service,
		|	SpaRooms.Price AS Price
		|FROM
		|	InformationRegister.SpaBookingHistory AS SpaBookingHistory
		|		LEFT JOIN Catalog.SpaRooms AS SpaRooms
		|		ON SpaBookingHistory.Room = SpaRooms.Ref
		|WHERE
		|	(&StartDate BETWEEN SpaBookingHistory.StartTime AND SpaBookingHistory.EndTime
		|				AND (&EndDate BETWEEN SpaBookingHistory.StartTime AND SpaBookingHistory.EndTime)
		|			OR SpaBookingHistory.StartTime = &StartDate
		|			OR SpaBookingHistory.EndTime = &EndDate
		|			OR SpaBookingHistory.EndTime BETWEEN &StartDate AND &EndDate)
		|
		|GROUP BY
		|	SpaBookingHistory.Room,
		|	SpaBookingHistory.StartTime,
		|	SpaBookingHistory.EndTime,
		|	SpaBookingHistory.Service,
		|	SpaRooms.Price";
		
		Query.SetParameter("StartDate", StartDate);
		Query.SetParameter("EndDate", EndDate);
		
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		PendingServices = 0;
		PendingArr = new Array();
		Pending = SpaRoom.GetItems().Add();
		Pending.ServiceKinds = "Pending services";
		While SelectionDetailRecords.Next() Do
			If PendingArr.Find(SelectionDetailRecords.Service)=undefined then
				PendingServices = PendingServices + SelectionDetailRecords.ServiceCount;
				PendingArr.Add(SelectionDetailRecords.Service);
				ReservedService = Pending.GetItems().Add();
				ReservedService.ServiceKinds = SelectionDetailRecords.Service;
				ReservedService.Price = SelectionDetailRecords.Service.Price;
				ReservedService.Quantity = SelectionDetailRecords.ServiceCount;
			Endif;
		EndDo;
		Pending.quantity = PendingServices;
	Else 
		Message("Start date can not be empty! ",MessageStatus.VeryImportant);
	EndIf;
EndProcedure
